import pandas as pd
import numpy as np

df['割合区分']=\
np.where(df['割合']<=0, '0%以下',
 np.where((df['割合']>0)&(df['割合']<=0.1),'≦10％',
  np.where((df['割合']>0.1)&(df['割合']<=0.2),'≦20％',
   np.where((df['割合']>0.2)&(df['割合']<=0.3),'≦30％',
    np.where((df['割合']>0.3)&(df['割合']<=0.4),'≦40％',
     np.where((df['割合']>0.4)&(df['割合']<=0.5),'≦50％',
      np.where((df['割合']>0.5)&(df['割合']<=0.6),'≦60％',
       np.where((df['割合']>0.6)&(df['割合']<=0.7),'≦70％',
        np.where((df['割合']>0.7)&(df['割合']<=0.8),'≦80％',
         np.where((df['割合']>0.8)&(df['割合']<=0.9),'≦90％',
          np.where((df['割合']>0.9)&(df['割合']<=1.0),'≦100％',
           np.where(df['割合']>1.0, '100%>', np.nan))))))))))))